---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarHandlePositionData.IsValidObject
source: html/53a48a0c-79f0-35e3-d42f-73871610d05c.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlePositionData.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.